{"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "registered_name": null, "name": "input_7", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 63, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "Constant", "config": {"value": {"class_name": "__tensor__", "config": {"value": [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.11422260105609894, 0.021883811801671982, -0.1658523976802826, 0.027023179456591606, 0.10202724486589432, 0.048878371715545654, 0.015268653631210327, 0.10774656385183334, 0.05712740123271942, 0.011172855272889137, -0.04888102412223816, -0.05299989506602287, 0.03582033887505531, 0.0658784806728363, 0.015364577993750572, 0.11414982378482819, 0.0008966242312453687, 0.05630994960665703, -0.04364847019314766, 0.040580227971076965, -0.07504534721374512, -0.1121598556637764, -0.04671088233590126, 0.12104232609272003, -0.09105678647756577, 0.12704317271709442, -0.22681067883968353, 0.20055632293224335, 0.06193181127309799, 0.18640507757663727, -0.020432954654097557, -0.14963208138942719, -0.15500536561012268, 0.07876323163509369, 0.06563381850719452, -0.2072744369506836, -0.00763646000996232, 0.02606503665447235, 0.02824544534087181, 0.2783026695251465, -0.056328631937503815, -0.06982188671827316, -0.049870725721120834, -0.04563911259174347, -0.00479553360491991, 0.16326111555099487, -0.029436200857162476, -0.10658110678195953, 0.032093681395053864, 0.0023278461303561926, -0.0607464574277401, -0.0340193472802639, -0.15564540028572083, -0.14950160682201385, 0.13886180520057678, 0.08963000029325485, -0.02941756136715412, -0.058788880705833435, 0.08654538542032242, -0.018544059246778488, -0.11064159870147705, -0.19127434492111206, -0.08937545865774155, 0.004216487053781748, -0.08759184926748276, -0.03300793468952179, 0.1136593446135521, -0.17458802461624146, -0.11656299233436584, 0.022385137155652046, -0.10641428828239441, -0.06187731400132179, -0.09418844431638718, -0.014640549197793007, -0.14632441103458405, 0.05973951146006584, -0.06473072618246078, 0.08117301762104034, -0.014160899445414543, 0.1893560290336609, 0.04399672895669937, -0.24625177681446075, -0.05086185410618782, -0.1649821549654007, -0.13282915949821472, 0.120557501912117, 0.0014885189011693, -0.015894044190645218, -0.0024426167365163565, -0.07934572547674179, -0.13527901470661163, -0.03825915604829788, -0.013350356370210648, 0.006994085386395454, -0.024123234674334526, -0.05877155438065529, 0.0647803246974945, 0.0016874669818207622, 0.03877381607890129, -0.08331762254238129], [-0.06469380855560303, 0.10787040740251541, 0.028002358973026276, -0.06624181568622589, 0.09530175477266312, 0.1066860780119896, 0.07487816363573074, -0.06519877910614014, 0.07358624786138535, -0.0303997453302145, 0.13388635218143463, -0.06675384938716888, 0.08396552503108978, -0.07795295119285583, 0.02112092822790146, -0.14304859936237335, -0.14446087181568146, 0.08865125477313995, -0.016136690974235535, 0.04799272492527962, -0.03323451429605484, 0.13566380739212036, 0.06453273445367813, -0.039828237146139145, -0.058271873742341995, 0.015036175027489662, -0.09411050379276276, 0.01695554330945015, 0.10584985464811325, -0.005644007585942745, -0.05556695908308029, 0.12874652445316315, -0.010309143923223019, 0.06998706609010696, -0.1162855252623558, -0.09174974262714386, -0.013560246676206589, 0.015010673552751541, 0.12363425642251968, -0.06457608193159103, 0.053684577345848083, -0.10717985033988953, -0.06625832617282867, 0.05262146145105362, 0.09536392986774445, -0.06626947224140167, -0.01754567213356495, -0.0736551582813263, 0.13791343569755554, -0.0002675098367035389, 0.10396388173103333, 0.021756893023848534, -0.0011466824216768146, 0.017488427460193634, 0.04246915504336357, -0.014348533004522324, 0.12422487139701843, 0.014716746285557747, -0.0893876701593399, -0.18023420870304108, 0.1279897391796112, -0.11685530096292496, 0.05386741831898689, -0.19525034725666046, -0.04485828056931496, -0.10621782392263412, 0.14006292819976807, -0.019466953352093697, -0.09393852949142456, -0.17425808310508728, -0.18650920689105988, -0.08510791510343552, -0.005771954543888569, 0.012504847720265388, -0.14711858332157135, -0.10117166489362717, 0.09127399325370789, 0.2764238715171814, 0.14159131050109863, -0.10301798582077026, 0.10898188501596451, -0.13393796980381012, -0.0358714796602726, -0.03518921136856079, -0.36277076601982117, -0.07930126786231995, -0.014685948379337788, 0.08276713639497757, -0.13877177238464355, 0.10177448391914368, -0.07504232972860336, -0.007926846854388714, 0.07602326571941376, 0.06445051729679108, -0.12238369137048721, 0.027286825701594353, 0.025794746354222298, -0.14135457575321198, -0.009099152870476246, -0.13181763887405396], [-0.07271943986415863, 0.23059101402759552, 0.0335715189576149, 0.06704654544591904, 0.010014457628130913, 0.016833463683724403, 0.02464337646961212, -0.04807061702013016, 0.006756018381565809, -0.15143048763275146, -0.09953498095273972, -0.07914730906486511, -0.07213768362998962, 0.039320312440395355, 0.003637246787548065, -0.08790554851293564, -0.14221398532390594, -0.0132014574483037, -0.12915152311325073, -0.05619879439473152, -0.12752126157283783, -0.05823024362325668, 0.17290590703487396, -0.058886297047138214, -0.047338150441646576, 0.012637000530958176, -0.09648865461349487, -0.05832374095916748, 0.24388805031776428, 0.068777896463871, 0.011145364493131638, 0.20417898893356323, -0.08703476935625076, -0.022019436582922935, -0.03120090812444687, -0.10047245025634766, 0.11216726899147034, 0.08990649878978729, 0.008772368542850018, 0.0064073847606778145, 0.11718855053186417, -0.07219882309436798, 0.04726822301745415, -0.04987144470214844, 0.09642557799816132, -0.0013779568253085017, -0.12635357677936554, -0.04436948522925377, 0.13228283822536469, 0.017319455742836, -0.07286351919174194, 0.09882062673568726, 0.0989174172282219, -0.0611557736992836, 0.04209420457482338, 0.07201499491930008, -0.050365425646305084, 0.017380448058247566, -0.11117672920227051, -0.038785383105278015, 0.0649455264210701, -0.10476161539554596, -0.007272026035934687, -0.015426731668412685, 0.027217242866754532, -0.2508014142513275, 0.03571227565407753, -0.015424724668264389, 0.032816506922245026, -0.17632219195365906, -0.1783100664615631, -0.01593003422021866, -0.02701452374458313, 0.07232139259576797, 0.09068374335765839, 0.006818773690611124, -0.0005889458698220551, 0.13613136112689972, -0.061673324555158615, 0.17264816164970398, 0.029765719547867775, -0.2616768777370453, -0.0870758518576622, -0.23662865161895752, -0.2337592989206314, -0.10759223252534866, 0.07496444880962372, -0.12584762275218964, -0.1104826033115387, 0.03113531693816185, -0.05536973848938942, -0.04421975091099739, -0.009695051237940788, 0.037213124334812164, -0.16475698351860046, -0.019901420921087265, -0.015998268499970436, -0.09641098976135254, -0.003974664956331253, -0.12284383177757263], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.0028359927237033844, 0.16089536249637604, 0.03573468700051308, 0.035349588841199875, 0.08577139675617218, 0.14829055964946747, 0.06449176371097565, -0.07285769283771515, 0.0485512800514698, -0.16533614695072174, 0.08667036890983582, -0.20331153273582458, 0.104332335293293, 0.09185396879911423, 0.0349857322871685, -0.048222776502370834, -0.062269426882267, 0.06205151230096817, 0.027090219780802727, 0.12158393114805222, -0.02480289898812771, -0.001066670985892415, -0.004740042611956596, 0.0340072326362133, -0.1140720546245575, -0.05408364534378052, -0.2102208435535431, 0.0936024934053421, 0.07577353715896606, 0.023810289800167084, 0.023442614823579788, 0.21145179867744446, 0.0001583453849889338, 0.02723284251987934, -0.022429585456848145, -0.17538826167583466, 0.010290398262441158, 0.05646248906850815, 0.20086394250392914, -0.11844833940267563, 0.09117469936609268, -0.13413988053798676, -0.12354762107133865, 0.034122589975595474, 0.12811478972434998, -0.11454237997531891, 0.014071290381252766, -0.09856504201889038, 0.07603035867214203, -0.01511349342763424, 0.033646464347839355, 0.024145688861608505, 0.02205599471926689, -0.029417021200060844, 0.09490584582090378, -0.02122293971478939, 0.01918565295636654, 0.12968571484088898, -0.08088041096925735, 0.021349407732486725, -0.12120123207569122, -0.14727598428726196, 0.10490868240594864, -0.09886456280946732, 0.07026296854019165, -0.056172654032707214, 0.06944023817777634, -0.06559060513973236, -0.15786217153072357, -0.06879665702581406, -0.13983102142810822, -0.08523163199424744, -0.12446707487106323, 0.06711889058351517, -0.1454486846923828, -0.023958902806043625, 0.11780720949172974, 0.2475689798593521, -0.009481018409132957, -0.14742544293403625, 0.019815195351839066, -0.024917833507061005, 0.040206797420978546, -0.11598268151283264, -0.22904072701931, -0.01765354536473751, 0.11420230567455292, 0.09577594697475433, -0.17150789499282837, 0.10380984097719193, -0.07077545672655106, -0.08071880787611008, -0.09662999957799911, 0.15019439160823822, -0.006894576363265514, 0.043623294681310654, 0.0810655727982521, -0.1092890277504921, 0.050192855298519135, -0.06358496099710464], [0.06460053473711014, 0.12105455994606018, -0.014109709300100803, 0.2838454842567444, 0.031583454459905624, -0.17178890109062195, 0.019150130450725555, -0.09474235773086548, 0.11143808811903, 0.03106604516506195, -0.045714858919382095, -0.07267507910728455, 0.013618907891213894, -0.046916477382183075, -0.12848760187625885, 0.014360612258315086, 0.031042087823152542, -0.09964121133089066, 0.1361744999885559, 0.11275134980678558, 0.12825022637844086, -0.07096889615058899, 0.05802733078598976, 0.07321687042713165, -0.19941475987434387, -0.06867232918739319, -0.12397465109825134, 0.1151629388332367, 0.174604132771492, 0.0799645259976387, 0.04185057431459427, 0.10741614550352097, -0.06883083283901215, 0.12199244648218155, -0.04628658667206764, -0.024959024041891098, 0.12789252400398254, 0.08707393705844879, 0.04815979674458504, 0.03540186956524849, -0.07485165446996689, 0.03181006386876106, -0.061742912977933884, 0.1048353835940361, 0.07104837894439697, -0.02761569432914257, -0.06254303455352783, -0.16196280717849731, -0.10421882569789886, -0.03452549874782562, 0.05532413348555565, 0.02903519757091999, 0.013611216098070145, -0.010120871476829052, 0.18203860521316528, -0.0011849302100017667, 0.024830350652337074, -0.1267392635345459, -0.11079427599906921, 0.04699418321251869, 0.03325510025024414, -0.14860935509204865, 0.11543663591146469, -0.2651965618133545, -0.26028797030448914, -0.07326771318912506, 0.12882393598556519, -0.0008539975387975574, -0.062043990939855576, 0.015944993123412132, -0.06674774736166, -0.003284795442596078, -0.07905184477567673, 0.08399306982755661, 0.013490230776369572, -0.10382162779569626, 0.16075663268566132, -0.008399532176554203, -0.0005727451643906534, -0.18261606991291046, -0.0713958889245987, -0.14196446537971497, 0.01248034369200468, -0.09832170605659485, -0.13153372704982758, 0.0017631212249398232, -0.07529284805059433, 0.028104674071073532, -0.08359353244304657, 0.13646085560321808, 0.10854919254779816, -0.027890048921108246, -0.029375718906521797, 0.07091794908046722, -0.04319494962692261, 0.13964001834392548, 0.09441199153661728, -0.022176271304488182, 0.1078096255660057, 0.0573151670396328], [0.004795779939740896, 0.043470073491334915, -0.11547601968050003, -0.030701858922839165, 0.14173126220703125, 0.045216504484415054, -0.18979501724243164, 0.05466089025139809, 0.0298453439027071, -0.04025080427527428, 0.06817567348480225, -0.18321260809898376, -0.024845732375979424, -0.009859235025942326, 0.03307466208934784, 0.0356304794549942, -0.11158948391675949, -0.0171037744730711, -0.01982824318110943, -0.0555131621658802, 0.019626285880804062, 0.004372443072497845, 0.012136961333453655, 0.07122033834457397, -0.09197523444890976, 0.10363326221704483, -0.2149021178483963, 0.07549984753131866, 0.06660442054271698, 0.046098485589027405, -0.1352638155221939, 0.08099739998579025, -0.12231564521789551, -0.033797431737184525, -0.07656800001859665, -0.062427639961242676, -0.08018919080495834, 0.09852147847414017, 0.14248667657375336, -0.0049610319547355175, -0.02263522334396839, -0.10045400261878967, -0.019050590693950653, -0.01736457645893097, 0.14087218046188354, -0.21856309473514557, 0.0027686553075909615, -0.047633904963731766, 0.04274405539035797, 0.011048538610339165, 0.013482560403645039, 0.06987821310758591, 0.08104828745126724, 0.004549922421574593, 0.0076595875434577465, 0.05066733807325363, 0.01977384090423584, -0.05025254935026169, 0.011595719493925571, -0.07106988877058029, 0.0005002401885576546, -0.13202977180480957, -0.20432357490062714, -0.09670204669237137, 0.057781822979450226, -0.2726629972457886, 0.0923120379447937, -0.0859757512807846, -0.025953687727451324, -0.11828925460577011, -0.2190815806388855, -0.08041602373123169, -0.05807560309767723, 0.1075604185461998, -0.08779005706310272, 0.0612645298242569, 0.06399191915988922, 0.2683035433292389, -0.1034078598022461, 0.08113180100917816, 0.06215514987707138, -0.10066574066877365, -0.05115805193781853, -0.1599462479352951, -0.10798005759716034, -0.13437452912330627, 0.17730571329593658, 0.10829873383045197, -0.016867620870471, 0.11270212382078171, -0.10950097441673279, -0.010280780494213104, -0.02137015014886856, 0.0792798325419426, -0.05854411795735359, -0.009249924682080746, 0.03402091562747955, -0.25731712579727173, 0.08395768702030182, -0.10416300594806671], [-0.12327246367931366, 0.020832115784287453, -0.2572890818119049, -0.09531573951244354, -0.036436405032873154, 0.03184134513139725, 0.03715379536151886, -0.08025896549224854, -0.055462781339883804, -0.03493231162428856, 0.09740419685840607, -0.012741699814796448, -0.1014251708984375, -0.07038862258195877, -0.14906932413578033, 0.10635638982057571, 0.09818540513515472, 0.06155168265104294, -0.1086902841925621, 0.18059737980365753, 0.02468039095401764, -0.02591911517083645, -0.026681464165449142, 0.03697454184293747, 0.002103358507156372, -0.007088757120072842, -0.08774759620428085, 0.248508021235466, 0.08661199361085892, 0.16261176764965057, -0.10429024696350098, 0.027707718312740326, 0.03606908768415451, -0.015887198969721794, -0.11445974558591843, -0.08592508733272552, 6.0918278904864565e-05, 0.06210266798734665, -0.007052756380289793, 0.05965831130743027, 0.07304582744836807, -0.24361179769039154, 0.06829069554805756, -0.04110931605100632, 0.06781661510467529, -0.05799826979637146, 0.0019169680308550596, -0.09505049884319305, -0.021385233849287033, -0.003160398919135332, -0.09330087155103683, 0.0037763912696391344, 0.05343514680862427, 0.03150887414813042, -0.04368221014738083, 0.022396348416805267, 0.007597524207085371, -0.1691160947084427, 0.035009995102882385, 0.00872723013162613, -0.015323675237596035, -0.269781231880188, 0.048140913248062134, -0.015897035598754883, 0.008666416630148888, 0.09079582244157791, 0.037501487880945206, 0.04346112534403801, 0.046111591160297394, -0.015355360694229603, 0.019739966839551926, 0.0792066678404808, -0.13181042671203613, -0.12991347908973694, -0.022207949310541153, -0.2789507508277893, 0.027489811182022095, -0.08222267031669617, -0.02093258500099182, -0.010190838947892189, -0.039694685488939285, -0.07757928967475891, -0.106498584151268, -0.10819659382104874, -0.2645607590675354, -0.1924036741256714, 0.11805330216884613, 0.03857307508587837, -0.07997559756040573, -0.02035256288945675, -0.20174317061901093, -0.0010614742059260607, -0.11162147670984268, 0.10746266692876816, 0.026374422013759613, 0.008465276099741459, -0.06735865026712418, -0.08642946928739548, 0.20548205077648163, -0.022416463121771812], [-0.17434385418891907, 0.2233584076166153, -0.18637341260910034, -0.004227978643029928, 0.033032193779945374, -0.06371240317821503, 0.01632343977689743, -0.16938480734825134, -0.0022834111005067825, -0.15452396869659424, 0.059308893978595734, -0.041828591376543045, -0.08979881554841995, -0.15006598830223083, 0.09912590682506561, 0.13665586709976196, 0.16274724900722504, 0.029097266495227814, 0.06237012520432472, 0.051356665790081024, 0.0042897299863398075, 0.04842862859368324, -0.08798426389694214, -0.03244522958993912, -0.08558641374111176, 0.10772987455129623, -0.04568925499916077, 0.15761031210422516, 0.017842598259449005, 0.11372240632772446, -0.10975749045610428, 0.04680252820253372, -0.12757249176502228, -0.048508401960134506, -0.13804547488689423, -0.060017723590135574, 0.0856528952717781, 0.13902445137500763, -0.09848393499851227, 0.05130375921726227, 0.13535942137241364, -0.10013920813798904, 0.10933134704828262, 0.08633603900671005, 0.16579002141952515, -0.05362464487552643, -0.13803136348724365, -0.012869106605648994, 0.003240276826545596, 0.021376390010118484, 0.016684234142303467, -0.27082401514053345, -0.009390583261847496, -0.017975714057683945, 0.051193106919527054, 0.05706994608044624, 0.08046839386224747, -0.13493670523166656, -0.03480810672044754, -0.0968850702047348, -0.0794670432806015, -0.1433759480714798, -0.061081573367118835, -0.1546313315629959, 0.09785012155771255, 0.0015689096180722117, 0.010715906508266926, 0.04667282849550247, 0.08923738449811935, -0.010942195542156696, -0.09724391251802444, 0.02119963988661766, -0.17249692976474762, -0.0022577052004635334, -0.04298851639032364, -0.2340896874666214, 0.057038553059101105, 0.0053029111586511135, 0.000582775566726923, 0.055687934160232544, 0.024260153993964195, -0.039471644908189774, -0.06231863796710968, -0.12210164219141006, -0.16281689703464508, -0.05975262075662613, 0.008114930242300034, 0.08826594799757004, -0.08623506873846054, -0.05776374042034149, -0.13186804950237274, 0.0644979178905487, -0.031237006187438965, -0.06270837783813477, 0.06882398575544357, 0.016171663999557495, 0.10847630351781845, -0.09143459051847458, 0.02591744437813759, -0.2278316766023636], [-0.008590733632445335, -0.022074079141020775, 0.022434789687395096, 0.24528484046459198, -0.06931512802839279, -0.25202956795692444, 0.0004174774221610278, -0.024263989180326462, 0.16253449022769928, 0.052412111312150955, -0.1025066003203392, 0.0473979115486145, -0.099422886967659, -0.03261319175362587, -0.024574987590312958, -0.001622387790121138, 0.01856508105993271, -0.07325407862663269, 0.055167410522699356, -0.17251919209957123, 0.08649499714374542, -0.018974749371409416, 0.13782095909118652, 0.04687350615859032, -0.007133241277188063, -0.12409656494855881, -0.10454469174146652, 0.12796075642108917, 0.11888538300991058, 0.01174871064722538, -0.07750541716814041, 0.04326631873846054, -0.143002450466156, -0.1416725069284439, 0.044999171048402786, 0.030296649783849716, -0.046468764543533325, 0.11483173072338104, 0.06125025823712349, -0.004675644915550947, -0.10746434330940247, -0.17449596524238586, 0.0015627804677933455, 0.0004392512491904199, 0.04873795807361603, -0.0258471742272377, -0.2695980668067932, -0.00014594377717003226, -0.15487222373485565, -0.08797341585159302, -0.12561273574829102, 0.08441852778196335, -0.02309327758848667, -0.05603828281164169, 0.12789875268936157, 0.12078289687633514, 0.0654088631272316, -0.12319575250148773, 0.06412331014871597, -0.049949321895837784, -0.06727167963981628, -0.03217599168419838, -0.07754147052764893, 0.022355258464813232, -0.07670726627111435, 0.03932754695415497, -0.0012374670477584004, -0.18290038406848907, 0.07091453671455383, -0.16797730326652527, -0.14134475588798523, -0.028686627745628357, -0.09405355900526047, 0.13327299058437347, 0.12524202466011047, -0.013052431866526604, 0.0030810516327619553, -0.13544529676437378, 0.10294760018587112, 0.01839275285601616, -0.1271369308233261, -0.20675820112228394, -0.0959002822637558, -0.11112388223409653, -0.10744535177946091, -0.057077426463365555, -0.012843159958720207, 0.03748787194490433, -0.14311806857585907, -0.1298869550228119, 0.18795856833457947, -0.07582485675811768, 0.00038324433262459934, 0.020237773656845093, 0.07460639625787735, 0.024243665859103203, -0.03700488805770874, 0.08870740979909897, -0.1298668086528778, 0.040234342217445374], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.045254338532686234, 0.19236712157726288, -0.1130666434764862, -0.0022780324798077345, 0.05781518295407295, -0.04188983514904976, 0.09956131130456924, -0.1973799169063568, -0.027057815343141556, -0.1737629920244217, 0.07677989453077316, 0.03375118598341942, -0.12416326254606247, -0.07985885441303253, 0.16876733303070068, 0.09503158181905746, 0.061120230704545975, -0.016219133511185646, 0.0701945424079895, 0.08809298276901245, -0.057149674743413925, 0.1506916582584381, -0.1290804147720337, -0.0015022142324596643, -0.05546814575791359, 0.03072936460375786, -0.12404933571815491, 0.14995180070400238, 0.0321328267455101, 0.24217236042022705, -0.17937079071998596, -0.05057342350482941, -0.0776432529091835, 0.14736424386501312, -0.04653351008892059, -0.07483748346567154, 0.11764013767242432, 0.08891217410564423, -0.002637703437358141, 0.12157519161701202, -0.07213649898767471, -0.05343092232942581, 0.04702702909708023, 0.0023934305645525455, 0.03579254820942879, -0.13180114328861237, 0.05671864002943039, 0.02554337866604328, -0.09437091648578644, 0.12241402268409729, -0.05638349801301956, -0.16357937455177307, -0.021655717864632607, -0.028976621106266975, -0.0380595438182354, 0.010204898193478584, 0.08788403123617172, -0.15456245839595795, -0.02563040517270565, -0.04391762241721153, -0.10552007704973221, -0.11869029700756073, 0.07771885395050049, -0.07561113685369492, 0.08689192682504654, 0.031129110604524612, 0.06947702914476395, 0.004391108173877001, 0.045696958899497986, -0.1078091636300087, -0.08058036863803864, 0.039061352610588074, -0.030896196141839027, -0.12047802656888962, -0.05659733712673187, -0.183399498462677, 0.1111452654004097, -0.07871297001838684, 0.1235329881310463, -0.004851237870752811, -0.10756036639213562, -0.10046063363552094, -0.1503228098154068, -0.1743026226758957, -0.07566402107477188, -0.2113833725452423, 0.1342746615409851, 0.1674579679965973, -0.06621522456407547, 0.005020659416913986, -0.08238385617733002, 0.07830096781253815, 0.0008619562722742558, -0.01828203909099102, -0.013337472453713417, 0.02296343259513378, -0.09826798737049103, -0.1641605645418167, 0.0963413417339325, -0.10941345244646072], [0.02744506299495697, -0.16824457049369812, 0.06073063984513283, 0.18188805878162384, 0.07945484668016434, -0.04754429683089256, 0.0327676460146904, 0.055934276431798935, -0.057758186012506485, -0.008806411176919937, -0.14344096183776855, -0.17566753923892975, 0.14151546359062195, 0.0822877585887909, 0.004546290263533592, 0.05266498401761055, 0.06858167797327042, 0.02459253929555416, 0.10728010535240173, -0.02913644164800644, 0.06388683617115021, 0.01421098131686449, -0.0014902119291946292, 0.21650739014148712, 0.16267997026443481, 0.005954846274107695, 0.08173639327287674, 0.06361425668001175, 0.1872660368680954, -0.034262143075466156, -0.06948409974575043, -0.06252730637788773, -0.143680602312088, -0.0130869559943676, 0.039451513439416885, 0.029708312824368477, 0.01321484986692667, -0.025671524927020073, 0.10572641342878342, -0.00836367066949606, 0.059473082423210144, -0.019884545356035233, -0.13055215775966644, 0.13550522923469543, -0.07796094566583633, -0.10540454089641571, -0.0808824747800827, -0.0008798099588602781, -0.04225676879286766, 0.06360459327697754, 0.04080243781208992, 0.10573695600032806, -0.06315702944993973, -0.031549546867609024, -0.09254688769578934, 0.05747434124350548, 0.009292780421674252, -0.09045319259166718, 0.09489598870277405, -0.037283655256032944, 0.061246756464242935, -0.15061333775520325, 0.017071222886443138, 0.1000400111079216, -0.2364688515663147, 0.12042447179555893, 0.21232973039150238, 0.01083062682300806, 0.026300590485334396, -0.25364771485328674, -0.050938140600919724, -0.17836259305477142, 0.04344451427459717, 0.0047166189178824425, -0.07029309123754501, -0.2553468346595764, 0.03333302214741707, 0.09770392626523972, -0.0002916399098467082, -0.0049500735476613045, -0.08875458687543869, 0.020365623757243156, 0.0376383513212204, -0.0640304759144783, -0.19119003415107727, -0.06893179565668106, -0.04682280868291855, 0.015403389930725098, -0.17606498301029205, -0.07032336294651031, 0.014065426774322987, -0.07764758914709091, 0.07665952295064926, -0.01522054523229599, -0.02029312774538994, 0.08268710970878601, 0.2688843905925751, -0.01397750061005354, 0.013968488201498985, -0.11415858566761017], [0.09223677963018417, -0.017889071255922318, 0.12355439364910126, 0.10142704099416733, 0.09979823976755142, -0.11355043947696686, 0.1662895530462265, -0.05078854784369469, -0.1020895466208458, 0.1082395687699318, -0.10202436149120331, -0.09131860733032227, 0.04547053575515747, -0.04552141949534416, -0.22933059930801392, 0.03417867422103882, 0.09435471892356873, -0.03623606637120247, -0.05678962171077728, 0.14828015863895416, 0.10019660741090775, 0.015087614767253399, 0.012680365703999996, 0.08321548253297806, 0.08369891345500946, -0.17559905350208282, 0.03058859333395958, 0.12273595482110977, 0.1419992744922638, 0.069752536714077, 0.0315692201256752, 0.003778444603085518, -0.02832159958779812, 0.005668424069881439, 0.04606804624199867, -0.24149413406848907, -0.016132676973938942, 0.010807938873767853, 0.10777842253446579, -0.11883176118135452, 0.03349199518561363, -0.1920766830444336, -0.10535602271556854, 0.14712372422218323, -0.1119661033153534, -0.10794361680746078, -0.13854138553142548, -0.1365988552570343, 0.0415828712284565, 0.0010258546099066734, 0.031303033232688904, 0.05062456429004669, -0.017599884420633316, -0.062476154416799545, 0.03363651782274246, 0.04182763025164604, 0.04220175743103027, -0.07950739562511444, -0.03192674741148949, 0.1988936811685562, -0.09307151287794113, -0.2551191747188568, 0.06582704186439514, -0.0077946241945028305, -0.1326693445444107, 0.013627332635223866, 0.04154549539089203, 0.055916670709848404, 0.06512995809316635, -0.1404566913843155, 0.023869335651397705, -0.044356200844049454, 0.027648773044347763, 0.04638756811618805, -0.005556872114539146, -0.08686693012714386, 0.032609663903713226, 0.05486875772476196, 0.020319906994700432, -0.03019513189792633, -0.09707900881767273, -0.17168569564819336, -0.01459969487041235, -0.07622281461954117, -0.21977193653583527, 0.09950359910726547, -0.046335529536008835, 0.07511238753795624, -0.13655230402946472, 0.025510895997285843, 0.11122474074363708, -0.03832271695137024, 0.11417795717716217, 0.07184939831495285, -0.05765128880739212, 0.18533168733119965, 0.10041207075119019, -0.18673621118068695, -0.0525161437690258, -0.09505658596754074], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.11381569504737854, 0.0804024487733841, -0.18125341832637787, -0.043987393379211426, -0.06239781901240349, 0.03185231238603592, 0.008351859636604786, -0.029565582051873207, -0.01835409179329872, -0.009576711803674698, 0.047117020934820175, -0.15214569866657257, 0.05822283774614334, -0.1292867809534073, -0.18121807277202606, 0.04703541845083237, 0.10604166239500046, -0.01297783199697733, -0.14494572579860687, 0.0017957455711439252, 0.037330202758312225, -0.06637001782655716, 0.10470552742481232, -0.06766601651906967, -0.08490113914012909, -0.09123950451612473, -0.0065559204667806625, 0.16053292155265808, 0.06537998467683792, 0.11901190876960754, -0.0870591253042221, 0.002519795671105385, 0.06605510413646698, 0.11168817430734634, -0.10738497972488403, -0.17155028879642487, 0.043666742742061615, 0.01675177365541458, 0.05269133299589157, -0.0008488003513775766, 0.041178151965141296, -0.1452513337135315, 0.05823575705289841, 0.056881632655858994, 0.0959169864654541, -0.14236097037792206, 0.06423716992139816, -0.05594499036669731, -0.037120480090379715, -0.09375166893005371, -0.09201153367757797, -0.03041946515440941, -0.012813198380172253, 0.02281060256063938, -0.03469749540090561, -0.004622067790478468, 0.06015762686729431, -0.11146049946546555, -0.08220149576663971, -0.08777755498886108, 0.0013307409826666117, -0.2218603640794754, 0.08909855782985687, -0.04030461609363556, -0.10483191907405853, -0.0870761126279831, 0.0839780643582344, -0.041933219879865646, 0.06065719947218895, -0.1469171643257141, -0.014933406375348568, 0.07537124305963516, -0.0654691532254219, 0.017022565007209778, -0.2364458590745926, -0.20484229922294617, -0.019692974165081978, 0.21206071972846985, 0.0029943850822746754, 0.1569337695837021, 0.09535688161849976, 0.052297595888376236, -0.04504026845097542, 0.0830540657043457, -0.23014238476753235, -0.0928490161895752, 0.08920980244874954, 0.041879139840602875, -0.1998441070318222, -0.11237284541130066, -0.2855938673019409, 0.053031716495752335, -0.04088452458381653, -0.09538356214761734, -0.0053230272606015205, 0.05644242838025093, 0.0065439785830676556, -0.030953748151659966, 0.1488722264766693, -0.03246159106492996], [-0.03870636969804764, 0.10196026414632797, 0.0009712639730423689, 0.06108934059739113, 0.08413960039615631, -0.05366978421807289, 0.02384747564792633, -0.03112754225730896, -0.014810837805271149, -0.0911971926689148, -0.07850274443626404, -0.1787838190793991, 0.053647857159376144, 0.06143537536263466, 0.005124220624566078, -0.06311057507991791, -0.03391754999756813, -0.024147439748048782, 0.10091117024421692, 0.04506178945302963, -0.11811727285385132, -0.09909041970968246, 0.1055971309542656, -0.1253778040409088, -0.017063606530427933, -0.0038764234632253647, -0.04011007770895958, -0.07673107087612152, 0.17688044905662537, -0.01221319567412138, 0.03227074071764946, 0.19442518055438995, -0.013582589104771614, 0.011334379203617573, -0.05401664972305298, -0.04674479737877846, 0.03653557971119881, 0.051439084112644196, 0.2017936259508133, -0.006831316277384758, 0.06481540203094482, -0.07901013642549515, -0.06580992788076401, 0.06837774068117142, 0.14485493302345276, -0.06536038964986801, -0.022196868434548378, -0.12058266252279282, 0.0072290897369384766, 0.06012093275785446, 0.1022726520895958, 0.19768819212913513, -0.0115509033203125, 0.12901006639003754, 0.10893210768699646, -0.02764170989394188, -0.09194640070199966, 0.007967337034642696, 0.03673785924911499, 0.027842001989483833, 0.03171504661440849, -0.28353351354599, 0.017398959025740623, 0.02152892015874386, -0.09270123392343521, -0.23216819763183594, 0.21664251387119293, 0.03911686688661575, -0.03148260340094566, -0.21930816769599915, -0.13234935700893402, -0.07635772973299026, -0.06363711506128311, 0.043890081346035004, -0.046129707247018814, -0.1636040061712265, 0.010407542809844017, 0.1900707483291626, -0.03217790275812149, 0.1270408183336258, -0.06468628346920013, -0.02962581254541874, -0.15625494718551636, -0.09614747017621994, -0.23586931824684143, 0.04537900164723396, 0.054319318383932114, 0.04834846407175064, -0.08962022513151169, 0.04990620166063309, -0.11176248639822006, -0.08709099143743515, 0.00028887062217108905, -0.002208660589531064, -0.04540446773171425, 0.11985305696725845, 0.017920490354299545, -0.24397824704647064, 0.017310690134763718, -0.0837068036198616], [-0.09188751876354218, 0.09233848750591278, -0.19550910592079163, 0.07688779383897781, -0.01760716363787651, 0.05384114384651184, -0.07800224423408508, -0.1351912021636963, 0.04227833077311516, -0.03880150988698006, 0.14729690551757812, 0.09073556959629059, -0.039823267608881, -0.14764215052127838, -0.0479547381401062, 0.1294914335012436, 0.01598249562084675, 0.11579666286706924, 0.09048624336719513, 0.07227596640586853, 0.02416151389479637, 0.09794818609952927, 0.009331000037491322, -0.028820084407925606, -0.04939582571387291, -0.026174044236540794, -0.2178405523300171, 0.2126210331916809, 0.024032633751630783, 0.14019393920898438, -0.11549635231494904, 0.1152544692158699, -0.09439220279455185, 0.027573231607675552, -0.02241714671254158, -0.06998114287853241, 0.18065106868743896, -0.0033491444773972034, 0.043122611939907074, -0.08399645239114761, -0.055723078548908234, -0.12924058735370636, 0.0414089672267437, 0.07653210312128067, 0.07356835156679153, 0.019743159413337708, 0.11087179183959961, -0.0835147425532341, -0.12900608777999878, 0.011502854526042938, 0.006609122268855572, -0.1526220142841339, 0.05150739103555679, 0.05197880417108536, 0.03949303552508354, 0.02958342619240284, 0.014177411794662476, -0.035620030015707016, 0.0858701840043068, -0.030071189627051353, -0.06616181880235672, -0.16764327883720398, -0.0022657234221696854, -0.163412943482399, 0.024947531521320343, 0.04197574406862259, 0.0892038494348526, -0.043751444667577744, 0.039323244243860245, -0.0390145480632782, 0.04641188308596611, 0.00678868405520916, -0.12029046565294266, 0.002135002752766013, 0.11448018997907639, -0.2838142216205597, -0.01874374970793724, 0.19909526407718658, 0.06452574580907822, 0.03181226924061775, -0.07376722991466522, -0.17823031544685364, -0.02774994634091854, -0.11866115033626556, -0.2068433165550232, -0.08159778267145157, 0.20402784645557404, 0.15614773333072662, 0.10099604725837708, 0.043130598962306976, -0.08525581657886505, 0.01892826147377491, 0.04449797794222832, 0.1556863635778427, 0.1507348120212555, 0.006399421952664852, -0.015014992095530033, -0.12735748291015625, 0.07396567612886429, -0.0015120517928153276], [-0.020548615604639053, 0.10453465580940247, -0.010631140321493149, 0.09045224636793137, 0.06920494884252548, -0.030119063332676888, 0.03499951213598251, -0.007669177372008562, -0.04200900346040726, -0.14487095177173615, -0.0482369102537632, -0.2141994684934616, 0.08125055581331253, 0.058750737458467484, 0.02654939331114292, -0.057539477944374084, -0.020950492471456528, -0.0067495061084628105, 0.07265888899564743, 0.05937410891056061, -0.11353236436843872, -0.0839310958981514, 0.05949312821030617, -0.09995505958795547, -0.03509684279561043, 0.004842258058488369, -0.06411382555961609, -0.05580374598503113, 0.16363868117332458, -0.029748594388365746, 0.047658637166023254, 0.1664319783449173, -0.04265817254781723, 0.0012140925973653793, -0.02141992561519146, -0.05586904659867287, -0.008945572189986706, 0.06161674112081528, 0.19534383714199066, -0.04880290850996971, 0.0765015184879303, -0.06109655648469925, -0.07506798952817917, 0.10871762782335281, 0.12422601878643036, -0.06689196825027466, 0.03221967816352844, -0.11340844631195068, -0.011328459717333317, 0.06546114385128021, 0.11131143569946289, 0.15871800482273102, -0.02342039905488491, 0.0708998516201973, 0.08007591962814331, -0.04290999844670296, -0.04680558666586876, 0.03588683903217316, 0.015702327713370323, 0.0011590864742174745, 0.07873948663473129, -0.2538432776927948, 0.001824607839807868, 0.06649917364120483, -0.12058434635400772, -0.16876453161239624, 0.21257126331329346, 0.028707079589366913, -0.027223924174904823, -0.22235442698001862, -0.10191646218299866, -0.08792751282453537, -0.07604838162660599, 0.02810576744377613, -0.010466021485626698, -0.17575311660766602, 0.06092532351613045, 0.22551146149635315, -0.027844393625855446, 0.08733607828617096, -0.0694386214017868, -0.03882436454296112, -0.1650623083114624, -0.10081794112920761, -0.24597518146038055, 0.008939903229475021, 0.08398892730474472, 0.05939348414540291, -0.13187895715236664, 0.002508840523660183, -0.08567454665899277, -0.12991735339164734, 0.05863870307803154, 0.0195163544267416, -0.06592553108930588, 0.18309110403060913, 0.03297007083892822, -0.25154438614845276, 0.0031638043001294136, -0.11723857372999191], [-0.19860219955444336, 0.15397611260414124, -0.18260137736797333, 0.026930250227451324, 0.11489689350128174, -0.1109616607427597, 0.03402217850089073, -0.13782718777656555, -0.059624478220939636, -0.2623625099658966, -0.0153963016346097, 0.019922224804759026, -0.08267026394605637, -0.10516674071550369, -0.002190670929849148, 0.15380287170410156, 0.1959005445241928, -0.01695534773170948, 0.1570623815059662, 0.090764120221138, -0.0062519460916519165, 0.022970788180828094, -0.11184854060411453, -0.04723680764436722, -0.11385651677846909, 0.06869202107191086, -0.09184198826551437, 0.23810409009456635, -0.004337860271334648, 0.111025869846344, -0.1713302731513977, 0.02787247858941555, -0.05211031064391136, -0.03257543221116066, -0.07856302708387375, -0.00781689677387476, 0.060966577380895615, 0.09901237487792969, -0.07007809728384018, 0.05957498028874397, 0.1336340457201004, -0.07241671532392502, 0.01038211677223444, 0.09953010827302933, 0.09335839003324509, -0.07719643414020538, -0.15531861782073975, 0.050857219845056534, -0.0634801909327507, 0.07907022535800934, -0.03016606904566288, -0.2805980443954468, -0.010283720679581165, 4.695771713159047e-05, 0.1093624010682106, -0.029731113463640213, 0.0237070694565773, -0.13913127779960632, -0.008067034184932709, -0.14692158997058868, -0.16063030064105988, -0.08828449994325638, 0.0015554830897599459, -0.006735350005328655, 0.028769493103027344, -0.0463336743414402, 0.03656784072518349, -0.08359815925359726, 0.024962682276964188, -0.013903300277888775, -0.0386807918548584, 0.064177967607975, -0.18530815839767456, 0.019612736999988556, -0.01688743568956852, -0.15339989960193634, 0.09669473767280579, 0.05957585945725441, 0.07047561556100845, 0.0805901363492012, -0.0008542077266611159, -0.011896276846528053, -0.020931599661707878, -0.09968492388725281, -0.0864829421043396, -0.11505260318517685, -0.03205883502960205, 0.09348300844430923, -0.00905544776469469, -0.019425518810749054, -0.12067354470491409, 0.04687764495611191, -0.007400482892990112, -0.08448585867881775, 0.09274706989526749, 0.010187297128140926, 0.1026405468583107, -0.09646818041801453, 0.002443748526275158, -0.22624440491199493], [-0.003700174856930971, 0.0859304815530777, 0.0115883219987154, 0.0977022647857666, 0.13612650334835052, -0.06290178745985031, 0.013752363622188568, -0.07850883156061172, 0.038638971745967865, -0.11169270426034927, -0.1051483154296875, -0.1831997185945511, 0.026003330945968628, -0.01770671270787716, 0.06852208077907562, -0.06513677537441254, -0.05998922884464264, -0.019401628524065018, -0.022016597911715508, -0.01933661289513111, -0.1208963617682457, -0.09453170746564865, 0.12309953570365906, -0.10710317641496658, 0.010924914851784706, -0.030934512615203857, -0.08761022239923477, -0.09746889770030975, 0.13503146171569824, -0.0020623947493731976, -0.007116092834621668, 0.16677425801753998, -0.09826614707708359, 0.03907383233308792, -0.13192583620548248, -0.0018121062312275171, 0.07735933363437653, 0.044489916414022446, 0.17039722204208374, -0.037884581834077835, 0.034988000988960266, -0.050908904522657394, -0.008714037947356701, -0.0480816587805748, 0.14712393283843994, -0.06967320293188095, 0.032558854669332504, -0.10178715735673904, 0.018366780132055283, 0.021852737292647362, 0.10470163077116013, 0.19375565648078918, 0.09617546200752258, 0.07087763398885727, 0.06423068046569824, 0.026039965450763702, 0.000997509341686964, -0.010655590333044529, -0.03262641653418541, -0.02129548415541649, 0.03005814179778099, -0.18711824715137482, 0.03203433379530907, -0.01996062695980072, -0.10086309164762497, -0.20751699805259705, 0.2396116703748703, 0.06678604334592819, -0.029820730909705162, -0.17817318439483643, -0.1995920091867447, -0.11695761233568192, -0.012710160575807095, 0.12287338078022003, -0.00014922552509233356, -0.08850689977407455, 0.05146106332540512, 0.2182517945766449, -0.08284939080476761, 0.19743375480175018, -0.0037288209423422813, -0.07569626718759537, -0.022804686799645424, -0.10013994574546814, -0.22521698474884033, -0.028181221336126328, 0.07955467700958252, 0.017580971121788025, -0.07992111891508102, 0.006858021020889282, -0.09375189989805222, -0.13264623284339905, -0.012697919271886349, 0.032031647861003876, -0.02194337546825409, 0.05913010984659195, -0.01998419128358364, -0.2977517247200012, 0.028632579371333122, -0.15779027342796326], [-0.024162856861948967, 0.15501198172569275, -0.23291227221488953, 0.05204816907644272, 0.038240328431129456, -0.022833647206425667, 0.05536835268139839, -0.13152755796909332, 0.005188166629523039, -0.057244133204221725, -0.027062419801950455, -0.08385071903467178, -0.09597345441579819, -0.08973924815654755, 0.05541389808058739, 0.040892329066991806, 0.15082947909832, 0.026297474279999733, 0.00677125109359622, 0.2918911576271057, 0.005200497340410948, 0.10766967386007309, -0.15354235470294952, -0.008513535372912884, -0.07014452666044235, -0.05569511279463768, -0.0034561329521238804, 0.123651884496212, -0.022915303707122803, 0.3326150178909302, -0.10511022806167603, -0.02134460210800171, 0.02659403160214424, 0.22939433157444, 0.004380607977509499, -0.08515194803476334, 0.04889464005827904, -0.004760660696774721, 0.1760021597146988, -0.017343442887067795, 0.0647481307387352, -0.14258994162082672, 0.0863829031586647, 0.1457827389240265, -0.049843817949295044, -0.08828034996986389, 0.0004482518706936389, 0.04160255566239357, -0.1471804976463318, -0.06110231205821037, -0.0050838119350373745, -0.04894546791911125, -0.027295395731925964, -0.16718222200870514, -0.05295950174331665, 0.019854053854942322, 0.11224552989006042, -0.08722822368144989, 0.17501090466976166, 0.03902126103639603, -0.012737218290567398, -0.10905101150274277, 0.09164202958345413, -0.044579435139894485, -0.10765735805034637, 0.017574453726410866, 0.06908399611711502, 0.13538959622383118, 0.1258595883846283, -0.12275171279907227, -0.04924136772751808, -0.06859541684389114, -0.043292250484228134, -0.08733349293470383, 0.01601238362491131, 0.011895007453858852, 0.07167939096689224, 0.001893361215479672, 0.0680491104722023, -0.0024002946447581053, -0.07969304174184799, -0.04633504897356033, -0.09610684216022491, -0.0036124372854828835, -0.06804071366786957, -0.1420358568429947, 0.16120073199272156, -0.0007714898674748838, 0.0848093181848526, -0.03069317154586315, -0.14679814875125885, 0.1006668359041214, 0.013733532279729843, 0.14655159413814545, 0.02123534493148327, 0.07815661281347275, 0.047589175403118134, -0.2153628170490265, -0.03250300884246826, 0.004258901346474886], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.017302431166172028, 0.1277599185705185, -0.0630471259355545, 0.006921033840626478, 0.13928760588169098, 0.15902072191238403, 0.05038676783442497, -0.1525357961654663, -0.09564608335494995, -0.03135272487998009, 0.14699231088161469, -0.14524273574352264, 0.0423893965780735, 0.02005099505186081, -0.07602343708276749, 0.009698843583464622, 0.14664803445339203, 0.06254644691944122, -0.011261017061769962, 0.03249722719192505, 0.0010839614551514387, -0.01784253679215908, 0.031411413103342056, 0.08772950619459152, -0.11181104928255081, -0.029961716383695602, -0.12930987775325775, 0.18168191611766815, 0.1482488214969635, 0.09814245998859406, -0.16252560913562775, -0.04616326838731766, -0.015311908908188343, 0.1233580932021141, 0.049140799790620804, -0.16918422281742096, -0.048501379787921906, 0.02458779327571392, 0.1409645974636078, 0.014958894811570644, 0.09483586996793747, -0.009606101550161839, 0.04387601092457771, 0.11098160594701767, -0.10241614282131195, -0.18036188185214996, -0.019308075308799744, -0.05991527810692787, 0.12731511890888214, -0.00795996654778719, -0.021630682051181793, 0.03487240895628929, -0.07814726233482361, -0.12781478464603424, -0.05688270553946495, 0.06771119683980942, 0.22173471748828888, -0.07079600542783737, 0.010828394442796707, 0.03473278507590294, -0.043119534850120544, -0.1942436844110489, -0.18732909858226776, 0.07897718995809555, -0.04764438420534134, -0.10176882892847061, -0.04495617747306824, 0.10802492499351501, -0.08729065954685211, -0.053876977413892746, 0.0185269583016634, -0.028274422511458397, -0.15361690521240234, -0.054057180881500244, 0.06890770047903061, -0.14131514728069305, -0.05218251422047615, 0.21049034595489502, -0.00685435114428401, 0.04569648951292038, -0.02367948740720749, -0.15831635892391205, -0.19254955649375916, 0.029343588277697563, -0.1139686182141304, -0.0030198078602552414, 0.05601190775632858, 0.08520631492137909, 0.12334691733121872, -0.08456175029277802, -0.17148162424564362, 0.0987623855471611, -0.09320418536663055, 0.12928617000579834, 0.03822755813598633, 0.16940650343894958, 0.06478197872638702, -0.12485995888710022, 0.048539768904447556, -0.0013670907355844975], [0.07876092940568924, -0.09576132893562317, 0.10481139272451401, 0.10451961308717728, 0.12224539369344711, -0.08976482599973679, 0.0360705740749836, 0.04510705918073654, -0.04760631546378136, 0.0298661720007658, -0.15030349791049957, -0.2224830985069275, 0.043522074818611145, 0.022310499101877213, -0.16158932447433472, 0.05109769478440285, 0.10962916165590286, -0.08113512396812439, 0.14168807864189148, 0.06602372974157333, -0.0293843112885952, -0.047599516808986664, -0.046002794057130814, 0.10618177801370621, 0.10823380947113037, 0.019971348345279694, -0.09383013099431992, 0.0938076600432396, 0.08308114856481552, -0.01696840114891529, 0.05752577260136604, -0.03730190917849541, -0.18479374051094055, -0.10797780752182007, 0.0017597329569980502, -0.07003358751535416, -0.0012749673333019018, -0.06794440746307373, 0.12921392917633057, -0.014325839467346668, -0.03671688213944435, -0.03727395460009575, -0.11356905847787857, 0.2136387676000595, -0.14659462869167328, 0.012035870924592018, -0.07185859978199005, -0.0018842400750145316, 0.09133797138929367, -0.09970907121896744, 0.04692443087697029, 0.14277030527591705, -0.10474995523691177, -0.009705678559839725, 0.06346108019351959, 0.04038555175065994, 0.019076919183135033, -0.0281160119920969, 0.11346086114645004, 0.09414368122816086, -0.057755474001169205, -0.15746554732322693, -0.015962300822138786, 0.06837067008018494, -0.15320879220962524, 0.02988177351653576, 0.04586285352706909, -0.03054065629839897, 0.0652230978012085, -0.24941307306289673, 0.019767919555306435, -0.10568998754024506, 0.07666581869125366, -0.00544477254152298, -0.03303748369216919, -0.2225608229637146, 0.007140324916690588, -0.04150233790278435, 0.006909938529133797, 0.0035652967635542154, -0.0826345756649971, -0.1599137783050537, 0.10366857796907425, -0.019032394513487816, -0.21252629160881042, -0.009024426341056824, -0.11549274623394012, 0.06833107769489288, -0.26427072286605835, 0.005039805546402931, 0.045867692679166794, -0.06474461406469345, 0.16503024101257324, 0.019602755084633827, 0.1726423054933548, 0.14153331518173218, 0.10826185345649719, -0.11780526489019394, 0.07191809266805649, -0.006929499562829733], [-0.05082367733120918, 0.11616545170545578, -0.05178156495094299, -0.03472018241882324, 0.10816481709480286, 0.10894842445850372, 0.04073835164308548, -0.07640325278043747, -0.032472770661115646, -0.01779722422361374, 0.18756182491779327, -0.11177798360586166, -0.06549807637929916, 0.007246449589729309, -0.10844118893146515, 0.0380512960255146, 0.08713040500879288, 0.08933088928461075, -0.13486768305301666, 0.08057902753353119, 0.06198641657829285, 0.0265660397708416, 0.02593645267188549, 0.01677500270307064, -0.09809023886919022, -0.1121906042098999, -0.1571681946516037, 0.17854078114032745, 0.14536283910274506, 0.1338488757610321, -0.1334732621908188, -0.10069844871759415, -0.05100646987557411, 